#include <iostream>
#include <enemy.h>

enemy::enemy(const float x, const float y) : shooter(x, y, "Textures/enemyset.png"), timeBeforeMoving(0), timeBeforeShot(0)
															//определение конструктора - используем унаследованный конструктор, 
															//передаем в него начальный координаты врага и файл с его спрайтом,
															//устанавливаем время до выстрела и время до смены направления движения по умолчанию на 0
{
	t_Sprite.setTextureRect(sf::IntRect(0 + 64 * (int)t_CurrentFrame, 2 * 64, 64, 64)); //обрезаем спрайт врага по той 'строчке', в которой он движется вниз 
	t_dir = down; //направление движения по умолчанию - вниз
}

enemy::~enemy() //определение деструктора - наследника
{
	std::cout << "Enemy "; //проверка удаления объекта класса - печать в консоль
}

void enemy::move(const sf::Int64 time) //определение функции-перемещения врага
{
	t_Speed = 0.1; //устанавливаем скорость перемещения
	timeBeforeMoving += time; //приращаем время движения 

	if (timeBeforeMoving > 1000 + rand() % 501) //если враг движется от 501 до 1000 мс
	{
		t_dir = TDIR(rand() % 4);	//случайно меняем его направление движения
		timeBeforeMoving = 0;		//устанавливаем время до смены движения на ноль
	}

	switch (t_dir) //если враг перемещается:
	{
	case right: //вправо, то
		t_dx = t_Speed; //приращение координаты x равно скорости врага - движемся вправо
		t_dy = 0;
		break;

	case left: //влево, то
		t_dx = -t_Speed; //приращение координаты x равно отрицательной скорости врага - движемся влево
		t_dy = 0;
		break;

	case down: //вниз, то
		t_dx = 0;
		t_dy = t_Speed; //приращение координаты y равно скорости врага - движемся вниз
		break;

	case up: //вверх, то
		t_dx = 0;
		t_dy = -t_Speed; //приращение координаты y равно скорости врага - движемся вверх
		break;
	}

	t_x += t_dx * time; //приращаем координату x
	t_y += t_dy * time; //приращаем координату y
}

void enemy::update(const sf::Int64 time, map& map) //определение функции-обновления объекта-врага во время игры по карте
{
	move(time); //передвигаем врага

	t_Speed = 0; //скорость врага = 0
	t_Sprite.setPosition(t_x, t_y); //устанавливаем спрайт врага по его координатам
	animate(time); //анимируем врага
	map_interaction(map); //взаимодействуем врага с картой
}