#include <iostream>
#include <SFML/Window.hpp>
#include <player.h>
#include <map.h>
using sf::Keyboard;

player::player(const float x, const float y) : shooter(x, y, "Textures/playerset.png"), timeBeforeShot(0)
//определение конструктора - используем унаследованный конструктор, 
//передаем в него начальный координаты игрока и файл с его спрайтом,
//устанавливаем время до выстрела по умолчанию на 0
//устанавливаем время до выстрела по умолчанию на 0
{

}

player::~player() //определение деструктора - наследника
{
	std::cout << "Player "; //проверка удаления объекта класса - печать в консоль
}

void player::move_1(const sf::Int64 time) //определение функции-перемещения игрока 1
{
	if (Keyboard::isKeyPressed(Keyboard::A)) //если нажали клавишу 'A' 
	{
		t_dir = left; //направление игрока - влево
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::D)) //если нажали клавишу 'D' 
	{
		t_dir = right; //направление игрока - вправо
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::W)) //если нажали клавишу 'W' 
	{
		t_dir = up; //направление игрока - вверх
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::S)) //если нажали клавишу 'вниз' 
	{
		t_dir = down; //направление игрока - вниз
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	switch (t_dir) //если игрок перемещается:
	{
	case right: //вправо, то
		t_dx = t_Speed; //приращение координаты x равно скорости игрока - движемся вправо
		t_dy = 0;
		break;

	case left: //влево, то
		t_dx = -t_Speed; //приращение координаты x равно отрицательной скорости игрока - движемся влево
		t_dy = 0;
		break;

	case down: //вниз, то
		t_dx = 0; 
		t_dy = t_Speed; //приращение координаты y равно скорости игрока - движемся вниз
		break;

	case up: //вверх, то
		t_dx = 0;
		t_dy = -t_Speed; //приращение координаты y равно скорости игрока - движемся вверх
		break;
	}

	t_x += t_dx * time; //приращаем координату x
	t_y += t_dy * time; //приращаем координату y
}

void player::move_2(const sf::Int64 time) //определение функции-перемещения игрока 2
{
	if (Keyboard::isKeyPressed(Keyboard::Left)) //если нажали клавишу влево 
	{
		t_dir = left; //направление игрока - влево
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::Right)) //если нажали клавишу вправо 
	{
		t_dir = right; //направление игрока - вправо
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::Up)) //если нажали клавишу вверх 
	{
		t_dir = up; //направление игрока - вверх
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	if (Keyboard::isKeyPressed(Keyboard::Down)) //если нажали клавишу вниз 
	{
		t_dir = down; //направление игрока - вниз
		t_Speed = 0.11; //устанавливаем скорость перемещения
	}

	switch (t_dir) //если игрок перемещается:
	{
	case right: //вправо, то
		t_dx = t_Speed; //приращение координаты x равно скорости игрока - движемся вправо
		t_dy = 0;
		break;

	case left: //влево, то
		t_dx = -t_Speed; //приращение координаты x равно отрицательной скорости игрока - движемся влево
		t_dy = 0;
		break;

	case down: //вниз, то
		t_dx = 0;
		t_dy = t_Speed; //приращение координаты y равно скорости игрока - движемся вниз
		break;

	case up: //вверх, то
		t_dx = 0;
		t_dy = -t_Speed; //приращение координаты y равно скорости игрока - движемся вверх
		break;
	}

	t_x += t_dx * time; //приращаем координату x
	t_y += t_dy * time; //приращаем координату y
}

void player::update_1(const sf::Int64 time, map& map) //определение функции-обновления объекта-игрока 1 во время игры по карте
{
	move_1(time); //передвигаем игрока 1

	t_Speed = 0; //скорость игрока 1 = 0
	t_Sprite.setPosition(t_x, t_y); //устанавливаем спрайт игрока по его координатам
	animate(time); //анимируем игрока
	map_interaction(map); //взаимодействуем игрока с картой
}

void player::update_2(const sf::Int64 time, map& map) //определение функции-обновления объекта-игрока 2 во время игры по карте
{
	move_2(time); //передвигаем игрока 2

	t_Speed = 0; //скорость игрока 2 = 0
	t_Sprite.setPosition(t_x, t_y); //устанавливаем спрайт игрока по его координатам
	animate(time); //анимируем игрока
	map_interaction(map); //взаимодействуем игрока с картой
}